kong-performance/src/results/app.log
Mon Jan 27 00:55:06 UTC 2020
Concurrency Level: 10

Summary:
  Total:	0.2556 secs
  Slowest:	0.0155 secs
  Fastest:	0.0004 secs
  Average:	0.0024 secs
  Requests/sec:	3913.0002
  
  Total data:	11480 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [326]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [530]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [105]	|■■■■■■■■
  0.006 [19]	|■
  0.008 [2]	|
  0.009 [10]	|■
  0.011 [3]	|
  0.012 [2]	|
  0.014 [0]	|
  0.015 [2]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0017 secs
  50% in 0.0022 secs
  75% in 0.0027 secs
  90% in 0.0040 secs
  95% in 0.0047 secs
  99% in 0.0092 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0155 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0081 secs
  resp wait:	0.0023 secs, 0.0003 secs, 0.0121 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1000 responses



Concurrency Level: 50

Summary:
  Total:	1.5753 secs
  Slowest:	0.0445 secs
  Fastest:	0.0004 secs
  Average:	0.0153 secs
  Requests/sec:	3174.0936
  
  Total data:	57564 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [166]	|■■■■
  0.009 [637]	|■■■■■■■■■■■■■■
  0.014 [902]	|■■■■■■■■■■■■■■■■■■■■
  0.018 [1307]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [1811]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.027 [107]	|■■
  0.031 [28]	|■
  0.036 [19]	|
  0.040 [19]	|
  0.044 [3]	|


Latency distribution:
  10% in 0.0076 secs
  25% in 0.0114 secs
  50% in 0.0171 secs
  75% in 0.0191 secs
  90% in 0.0205 secs
  95% in 0.0217 secs
  99% in 0.0282 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0445 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0030 secs
  resp wait:	0.0152 secs, 0.0003 secs, 0.0444 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0047 secs

Status code distribution:
  [200]	5000 responses



Concurrency Level: 100

Summary:
  Total:	3.3651 secs
  Slowest:	0.0830 secs
  Fastest:	0.0009 secs
  Average:	0.0331 secs
  Requests/sec:	2971.6630
  
  Total data:	115801 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.009 [86]	|■
  0.017 [603]	|■■■■■■■
  0.026 [1102]	|■■■■■■■■■■■■
  0.034 [3587]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.042 [3173]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.050 [1044]	|■■■■■■■■■■■■
  0.058 [387]	|■■■■
  0.067 [10]	|
  0.075 [3]	|
  0.083 [4]	|


Latency distribution:
  10% in 0.0207 secs
  25% in 0.0284 secs
  50% in 0.0331 secs
  75% in 0.0391 secs
  90% in 0.0439 secs
  95% in 0.0487 secs
  99% in 0.0536 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0009 secs, 0.0830 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0209 secs
  resp wait:	0.0327 secs, 0.0004 secs, 0.0830 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0289 secs

Status code distribution:
  [200]	10000 responses



Concurrency Level: 200

Summary:
  Total:	4.2838 secs
  Slowest:	0.1435 secs
  Fastest:	0.0004 secs
  Average:	0.0415 secs
  Requests/sec:	4668.7537
  
  Total data:	230878 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.015 [338]	|■■
  0.029 [3312]	|■■■■■■■■■■■■■■■■
  0.043 [8512]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.058 [5392]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.072 [1432]	|■■■■■■■
  0.086 [841]	|■■■■
  0.101 [140]	|■
  0.115 [10]	|
  0.129 [5]	|
  0.143 [17]	|


Latency distribution:
  10% in 0.0255 secs
  25% in 0.0319 secs
  50% in 0.0398 secs
  75% in 0.0473 secs
  90% in 0.0608 secs
  95% in 0.0723 secs
  99% in 0.0854 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0004 secs, 0.1435 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0272 secs
  resp wait:	0.0410 secs, 0.0004 secs, 0.1434 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0438 secs

Status code distribution:
  [200]	20000 responses



Concurrency Level: 300

Summary:
  Total:	7.8757 secs
  Slowest:	0.2471 secs
  Fastest:	0.0004 secs
  Average:	0.0764 secs
  Requests/sec:	3809.1675
  
  Total data:	346186 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.025 [1020]	|■■■■
  0.050 [5835]	|■■■■■■■■■■■■■■■■■■■■■■
  0.074 [10601]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.099 [4492]	|■■■■■■■■■■■■■■■■■
  0.124 [4511]	|■■■■■■■■■■■■■■■■■
  0.148 [2527]	|■■■■■■■■■■
  0.173 [728]	|■■■
  0.198 [156]	|■
  0.222 [113]	|
  0.247 [16]	|


Latency distribution:
  10% in 0.0388 secs
  25% in 0.0513 secs
  50% in 0.0668 secs
  75% in 0.1018 secs
  90% in 0.1270 secs
  95% in 0.1344 secs
  99% in 0.1719 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0004 secs, 0.2471 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0365 secs
  resp wait:	0.0756 secs, 0.0003 secs, 0.2454 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0492 secs

Status code distribution:
  [200]	30000 responses



Concurrency Level: 400

Summary:
  Total:	9.6307 secs
  Slowest:	1.2749 secs
  Fastest:	0.0007 secs
  Average:	0.0930 secs
  Requests/sec:	4153.3958
  
  Total data:	461218 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.128 [33261]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.256 [6646]	|■■■■■■■■
  0.383 [91]	|
  0.510 [0]	|
  0.638 [0]	|
  0.765 [0]	|
  0.893 [0]	|
  1.020 [0]	|
  1.147 [0]	|
  1.275 [1]	|


Latency distribution:
  10% in 0.0502 secs
  25% in 0.0695 secs
  50% in 0.0886 secs
  75% in 0.1148 secs
  90% in 0.1401 secs
  95% in 0.1488 secs
  99% in 0.1942 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0007 secs, 1.2749 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0002 secs, 0.0000 secs, 0.0517 secs
  resp wait:	0.0920 secs, 0.0006 secs, 1.2743 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0414 secs

Status code distribution:
  [200]	40000 responses



Concurrency Level: 500

Summary:
  Total:	10.1966 secs
  Slowest:	0.3516 secs
  Fastest:	0.0005 secs
  Average:	0.0989 secs
  Requests/sec:	4903.5865
  
  Total data:	576332 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.036 [1005]	|■
  0.071 [7267]	|■■■■■■■■■■
  0.106 [28605]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.141 [7221]	|■■■■■■■■■■
  0.176 [2775]	|■■■■
  0.211 [2588]	|■■■■
  0.246 [318]	|
  0.281 [194]	|
  0.316 [5]	|
  0.352 [21]	|


Latency distribution:
  10% in 0.0602 secs
  25% in 0.0794 secs
  50% in 0.0928 secs
  75% in 0.1073 secs
  90% in 0.1516 secs
  95% in 0.1831 secs
  99% in 0.2132 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0005 secs, 0.3516 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.1091 secs
  resp wait:	0.0967 secs, 0.0005 secs, 0.3515 secs
  resp read:	0.0008 secs, 0.0000 secs, 0.0716 secs

Status code distribution:
  [200]	50000 responses